app/controllers/habit_logs_controller.rb

  def index
    habit = Habit.find(params[:habit_id])
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 715 LIMIT 1

  def create
    habit = Habit.find(params[:habit_id])

    log = habit.habit_logs.new(log_params)
    if log.save
      render json: log, status: :created
    else
      render json: { error: log.errors.full_messages.join(", ") }, status: :unprocessable_entity
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 731 LIMIT 1
INSERT INTO "habit_logs" ("habit_id", "profile_id", "log_date", "notes", "extra_data", "created_at", "updated_at") VALUES (731, 693, '2026-01-14', '', '{}', '2026-01-14 07:28:38.566066', '2026-01-14 07:28:38.566066') RETURNING "id"
SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 715

  def destroy
    habit = Habit.find(params[:habit_id])
    log = habit.habit_logs.find(params[:id])

    if log.destroy
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 731 LIMIT 1
SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 731 AND "habit_logs"."id" = 748 LIMIT 1
DELETE FROM "habit_logs" WHERE "habit_logs"."id" = 748