app/controllers/habits_controller.rb

  def update
    habit = Habit.find(params[:id])
    if habit.update(habit_params)
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 627 LIMIT 1
UPDATE "habits" SET "name" = 'Changed Diaper Log' WHERE "habits"."id" = 742

  def create
    habit = @profile.habits.new(habit_params)
    if habit.save
      render json: habit, status: :created
    else
      render json: { error: habit.errors.full_messages.join(", ") }, status: :unprocessable_entity
---
INSERT INTO "habits" ("profile_id", "name", "description", "category") VALUES (693, 'qwdeqwd', 'qwdqwd', 'diaper') RETURNING "id"
SELECT "habits".* FROM "habits" WHERE "habits"."profile_id" = 693

  def destroy
  habit = Habit.find_by(id: params[:id])
  if habit
    habit.destroy
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 732 LIMIT 1
DELETE FROM "habits" WHERE "habits"."id" = 732

  def set_profile
    @profile = Profile.find(params[:profile_id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 693 LIMIT 1

  def current_user
    @current_user ||= User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 622 LIMIT 1