app/controllers/milestones_controller.rb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."profile_id" = 693 ORDER BY "milestones"."occurred_at" DESC
---
  def index
    milestones = @profile.milestones.order(occurred_at: :desc)

INSERT INTO "milestones" ("profile_id", "title", "category", "occurred_at", "mood", "notes", "tags", "favorite", "created_at", "updated_at") VALUES (693, 'awdawd', 'Firsts', '2026-01-11 18:58:00', 'Delighted', '', '[]', FALSE, '2026-01-11 18:58:57.137438', '2026-01-11 18:58:57.137438') RETURNING "id"
---
  def create
    milestone = @profile.milestones.new(milestone_params)
    if milestone.save

UPDATE "milestones" SET "favorite" = TRUE, "updated_at" = '2026-01-19 04:58:03.626148' WHERE "milestones"."id" = 47
---
  def update
    if @milestone.update(milestone_params)

DELETE FROM "milestones" WHERE "milestones"."id" = 46
---
  def destroy
    @milestone.destroy

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 693 LIMIT 1
---
  def set_profile
    @profile = Profile.find(params[:profile_id])

SELECT "milestones".* FROM "milestones" WHERE "milestones"."id" = 46 LIMIT 1
---
  def set_milestone
    @milestone = Milestone.find(params[:id])