app/controllers/profiles_controller.rb

  def show
    profile = @user.profiles.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 622

  def create
    profile = @user.profiles.new(profile_params)
    if profile.save
      default_habits = case profile.profile_type
      when "Baby"
          [
            { name: "Diaper Change", description: "Change diaper", category: "diaper" },
            { name: "Feeding", description: "Feed baby", category: "babyFeed" },
            { name: "Bathe", description: "Bathe baby", category: "babyBath" },
            { name: "Nap", description: "Nap time", category: "sleeping" }
          ]
      when "Adult"
          [
            { name: "Drink Water", description: "Stay hydrated", category: "drinkingWater" },
            { name: "Exercise", description: "Physical activity", category: "exercise" },
            { name: "Meals", description: "Full meals", category: "meals" }
          ]
      else
          []
      end
      habit_errors = []
      default_habits.each do |habit_attrs|
        habit = profile.habits.create(habit_attrs)
---
INSERT INTO "profiles" ("user_id", "first_name", "last_name", "dob", "profile_type") VALUES (622, 'Madison', 'asdasd', '2026-01-05', 'Baby') RETURNING "id"
INSERT INTO "habits" ("profile_id", "name", "description", "category") VALUES (741, 'Diaper Change', 'Change diaper', 'diaperChange') RETURNING "id"

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "first_name" = 'bogawdawdawdawdawdawdawd' WHERE "profiles"."id" = 966

  def destroy
    if @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = 15

  def set_profile
    @profile = @user.profiles.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 4 AND "profiles"."id" = 15 LIMIT 1