app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 965 LIMIT 1
UPDATE "users" SET "first_name" = 'b', "updated_at" = '2026-02-19 18:23:07.185628' WHERE "users"."id" = 965